// 包含标准输入输出函数
#include <stdio.h>
// 定义main函数
int main()
{
    // 请在此添加‘奖金发放’的代码,预期格式如下，可改动。
    /*****************Begin******************/
    double money, bonus;
    scanf("%lf", &money);
    if (money <= 100000){
        bonus = money * 0.1;
    }
    else if (money > 100000 && money <= 200000){
        bonus = (money - 100000) * 0.075 + 100000 * 0.1;
    }
    else if (money > 200000 && money <= 400000){
        bonus = (money - 200000) * 0.05 + 100000 * 0.1 + 100000 * 0.075;
    }
    else if (money > 400000 && money <= 600000){
        bonus = (money - 400000) * 0.03 + 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05;
    }
    else if (money > 600000 && money <= 1000000){
        bonus = (money - 600000) * 0.015 + 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03;
    }
    else{
        bonus = (money - 1000000) * 0.01 + 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + 400000 * 0.015;
    }
    printf("%.2f", bonus);
    /***************** End ******************/
    return 0;
}
